SectionnerClient/Sectionner.GetUsersList.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:ns="Sectionner">
 <SOAP-ENV:Body>
  <!-- ns__GetUsersList(..., ns__User requestUserInfo, ...) -->
  <ns:GetUsersList>
   <!-- ns__User requestUserInfo -->
   <requestUserInfo>
    <!-- int userId -->
    <userId>0</userId>
    <!-- std::string userName -->
    <userName></userName>
    <!-- std::string userPassword -->
    <userPassword></userPassword>
    <!-- std::string userNewPassword -->
    <userNewPassword></userNewPassword>
    <!-- std::string userFirstName -->
    <userFirstName></userFirstName>
    <!-- std::string userLastName -->
    <userLastName></userLastName>
    <!-- enum ns__UserType userType -->
    <userType>Monitor</userType>
    <!-- std::string userKey -->
    <userKey></userKey>
    <!-- time_t userSubmit -->
    <userSubmit>2016-05-24T06:19:17Z</userSubmit>
    <!-- ns__ErrorCode userError -->
    <userError>
     <!-- int errorNumber -->
     <errorNumber>0</errorNumber>
     <!-- std::string errorMessage -->
     <errorMessage></errorMessage>
     <!-- enum ns__SettingLevel errorType -->
     <errorType>Normal</errorType>
    </userError>
   </requestUserInfo>
  </ns:GetUsersList>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
